eclipse-threadx/getting-started/SiliconLabs/EFR32MG12/lib/gecko_sdk_3.0.0_efr32mg12/platform/emdrv/spidrv/src/spidrv.c
  if ( (retVal = TransferApiBlockingPrologue(handle, (void*)buffer, count))
       != ECODE_EMDRV_SPIDRV_OK ) {
    return retVal;
  }

  if ( timeoutMs ) {
    sl_sleeptimer_start_timer_ms(&handle->timer, timeoutMs, SlaveTimeout, handle, 0, 0);
  }

  if ( handle->initData.slaveStartMode == spidrvSlaveStartDelayed ) {
    if ( (retVal = WaitForIdleLine(handle)) != ECODE_EMDRV_SPIDRV_OK ) {
      return retVal;
    }
  }

  StartTransmitDMA(handle, buffer, count, BlockingComplete);

  WaitForTransferCompletion(handle);

  return handle->transferStatus;
}
#endif

/// @cond DO_NOT_INCLUDE_WITH_DOXYGEN

/***************************************************************************//**
 * @brief
 *    Transfer complete callback function used by blocking transfer API
 *    functions. Called by DMA interrupt handler, timer timeout handler
 *    or @ref SPIDRV_AbortTransfer() function.
 ******************************************************************************/
static void BlockingComplete(SPIDRV_Handle_t handle,
                             Ecode_t transferStatus,
                             int itemsTransferred)
{
  (void)itemsTransferred;

  handle->transferStatus    = transferStatus;
  handle->blockingCompleted = true;
}

#if defined(_SILICON_LABS_32B_SERIES_0)
/***************************************************************************//**
 * @brief Get SPI pins for Series 0 devices.
 ******************************************************************************/
static Ecode_t GetSpiPins(SPIDRV_Handle_t handle, SPI_Pins_t * pins)
{
  uint32_t location;

  location = handle->initData.portLocation;

  if ( 0 ) {
#if defined(USART0)
  } else if ( handle->initData.port == USART0 ) {
    pins->mosiPort = AF_USART0_TX_PORT(location);
    pins->misoPort = AF_USART0_RX_PORT(location);
    pins->clkPort  = AF_USART0_CLK_PORT(location);
    pins->csPort   = AF_USART0_CS_PORT(location);
    pins->mosiPin  = AF_USART0_TX_PIN(location);
    pins->misoPin  = AF_USART0_RX_PIN(location);
    pins->clkPin   = AF_USART0_CLK_PIN(location);
    pins->csPin    = AF_USART0_CS_PIN(location);
#endif
#if defined(USART1)
  } else if ( handle->initData.port == USART1 ) {
    pins->mosiPort = AF_USART1_TX_PORT(location);
    pins->misoPort = AF_USART1_RX_PORT(location);
    pins->clkPort  = AF_USART1_CLK_PORT(location);
    pins->csPort   = AF_USART1_CS_PORT(location);
    pins->mosiPin  = AF_USART1_TX_PIN(location);
    pins->misoPin  = AF_USART1_RX_PIN(location);
    pins->clkPin   = AF_USART1_CLK_PIN(location);
    pins->csPin    = AF_USART1_CS_PIN(location);
#endif
#if defined(USART2)
  } else if ( handle->initData.port == USART2 ) {
    pins->mosiPort = AF_USART2_TX_PORT(location);
    pins->misoPort = AF_USART2_RX_PORT(location);
    pins->clkPort  = AF_USART2_CLK_PORT(location);
    pins->csPort   = AF_USART2_CS_PORT(location);
    pins->mosiPin  = AF_USART2_TX_PIN(location);
    pins->misoPin  = AF_USART2_RX_PIN(location);
    pins->clkPin   = AF_USART2_CLK_PIN(location);
    pins->csPin    = AF_USART2_CS_PIN(location);
#endif
#if defined(USARTRF0)
  } else if ( handle->initData.port == USARTRF0 ) {
    pins->mosiPort = AF_USARTRF0_TX_PORT(location);
    pins->misoPort = AF_USARTRF0_RX_PORT(location);
    pins->clkPort  = AF_USARTRF0_CLK_PORT(location);
    pins->csPort   = AF_USARTRF0_CS_PORT(location);
    pins->mosiPin  = AF_USARTRF0_TX_PIN(location);
    pins->misoPin  = AF_USARTRF0_RX_PIN(location);
    pins->clkPin   = AF_USARTRF0_CLK_PIN(location);
    pins->csPin    = AF_USARTRF0_CS_PIN(location);
#endif
#if defined(USARTRF1)
  } else if ( handle->initData.port == USARTRF1 ) {
    pins->mosiPort = AF_USARTRF1_TX_PORT(location);
    pins->misoPort = AF_USARTRF1_RX_PORT(location);
    pins->clkPort  = AF_USARTRF1_CLK_PORT(location);
    pins->csPort   = AF_USARTRF1_CS_PORT(location);
    pins->mosiPin  = AF_USARTRF1_TX_PIN(location);
    pins->misoPin  = AF_USARTRF1_RX_PIN(location);
    pins->clkPin   = AF_USARTRF1_CLK_PIN(location);
    pins->csPin    = AF_USARTRF1_CS_PIN(location);
#endif
  } else {
    return ECODE_EMDRV_SPIDRV_PARAM_ERROR;
  }
  return ECODE_EMDRV_SPIDRV_OK;
}
#endif

#if defined(_SILICON_LABS_32B_SERIES_1)
/***************************************************************************//**
 * @brief Get SPI pins for Series 1 devices.
 ******************************************************************************/
static Ecode_t GetSpiPins(SPIDRV_Handle_t handle, SPI_Pins_t * pins)
{
  SPIDRV_Init_t *initData;
  initData = &handle->initData;

  if ( 0 ) {
#if defined(USART0)
  } else if ( handle->initData.port == USART0 ) {
    pins->mosiPort = AF_USART0_TX_PORT(initData->portLocationTx);
    pins->misoPort = AF_USART0_RX_PORT(initData->portLocationRx);
    pins->clkPort  = AF_USART0_CLK_PORT(initData->portLocationClk);
    pins->csPort   = AF_USART0_CS_PORT(initData->portLocationCs);
    pins->mosiPin  = AF_USART0_TX_PIN(initData->portLocationTx);
    pins->misoPin  = AF_USART0_RX_PIN(initData->portLocationRx);
    pins->clkPin   = AF_USART0_CLK_PIN(initData->portLocationClk);
    pins->csPin    = AF_USART0_CS_PIN(initData->portLocationCs);
#endif
#if defined(USART1)
  } else if ( handle->initData.port == USART1 ) {
    pins->mosiPort = AF_USART1_TX_PORT(initData->portLocationTx);
    pins->misoPort = AF_USART1_RX_PORT(initData->portLocationRx);
    pins->clkPort  = AF_USART1_CLK_PORT(initData->portLocationClk);
    pins->csPort   = AF_USART1_CS_PORT(initData->portLocationCs);
    pins->mosiPin  = AF_USART1_TX_PIN(initData->portLocationTx);
    pins->misoPin  = AF_USART1_RX_PIN(initData->portLocationRx);
    pins->clkPin   = AF_USART1_CLK_PIN(initData->portLocationClk);
    pins->csPin    = AF_USART1_CS_PIN(initData->portLocationCs);
#endif
#if defined(USART2)
  } else if ( handle->initData.port == USART2 ) {
    pins->mosiPort = AF_USART2_TX_PORT(initData->portLocationTx);
    pins->misoPort = AF_USART2_RX_PORT(initData->portLocationRx);
    pins->clkPort  = AF_USART2_CLK_PORT(initData->portLocationClk);
    pins->csPort   = AF_USART2_CS_PORT(initData->portLocationCs);
    pins->mosiPin  = AF_USART2_TX_PIN(initData->portLocationTx);
    pins->misoPin  = AF_USART2_RX_PIN(initData->portLocationRx);
    pins->clkPin   = AF_USART2_CLK_PIN(initData->portLocationClk);
    pins->csPin    = AF_USART2_CS_PIN(initData->portLocationCs);
#endif
#if defined(USART3)
  } else if ( handle->initData.port == USART3 ) {
    pins->mosiPort = AF_USART3_TX_PORT(initData->portLocationTx);
    pins->misoPort = AF_USART3_RX_PORT(initData->portLocationRx);
    pins->clkPort  = AF_USART3_CLK_PORT(initData->portLocationClk);
    pins->csPort   = AF_USART3_CS_PORT(initData->portLocationCs);
    pins->mosiPin  = AF_USART3_TX_PIN(initData->portLocationTx);
    pins->misoPin  = AF_USART3_RX_PIN(initData->portLocationRx);
    pins->clkPin   = AF_USART3_CLK_PIN(initData->portLocationClk);
    pins->csPin    = AF_USART3_CS_PIN(initData->portLocationCs);
#endif
#if defined(USART4)
  } else if ( handle->initData.port == USART4 ) {
    pins->mosiPort = AF_USART4_TX_PORT(initData->portLocationTx);
    pins->misoPort = AF_USART4_RX_PORT(initData->portLocationRx);
    pins->clkPort  = AF_USART4_CLK_PORT(initData->portLocationClk);
    pins->csPort   = AF_USART4_CS_PORT(initData->portLocationCs);
    pins->mosiPin  = AF_USART4_TX_PIN(initData->portLocationTx);
    pins->misoPin  = AF_USART4_RX_PIN(initData->portLocationRx);
    pins->clkPin   = AF_USART4_CLK_PIN(initData->portLocationClk);
    pins->csPin    = AF_USART4_CS_PIN(initData->portLocationCs);
#endif
#if defined(USART5)
  } else if ( handle->initData.port == USART5 ) {
    pins->mosiPort = AF_USART5_TX_PORT(initData->portLocationTx);
    pins->misoPort = AF_USART5_RX_PORT(initData->portLocationRx);
    pins->clkPort  = AF_USART5_CLK_PORT(initData->portLocationClk);
    pins->csPort   = AF_USART5_CS_PORT(initData->portLocationCs);
    pins->mosiPin  = AF_USART5_TX_PIN(initData->portLocationTx);
    pins->misoPin  = AF_USART5_RX_PIN(initData->portLocationRx);
    pins->clkPin   = AF_USART5_CLK_PIN(initData->portLocationClk);
    pins->csPin    = AF_USART5_CS_PIN(initData->portLocationCs);
#endif
#if defined(USARTRF0)
  } else if ( handle->initData.port == USARTRF0 ) {
    pins->mosiPort = AF_USARTRF0_TX_PORT(initData->portLocationTx);
    pins->misoPort = AF_USARTRF0_RX_PORT(initData->portLocationRx);
    pins->clkPort  = AF_USARTRF0_CLK_PORT(initData->portLocationClk);
    pins->csPort   = AF_USARTRF0_CS_PORT(initData->portLocationCs);
    pins->mosiPin  = AF_USARTRF0_TX_PIN(initData->portLocationTx);
    pins->misoPin  = AF_USARTRF0_RX_PIN(initData->portLocationRx);
    pins->clkPin   = AF_USARTRF0_CLK_PIN(initData->portLocationClk);
    pins->csPin    = AF_USARTRF0_CS_PIN(initData->portLocationCs);
#endif
#if defined(USARTRF1)
  } else if ( handle->initData.port == USARTRF1 ) {
    pins->mosiPort = AF_USARTRF1_TX_PORT(initData->portLocationTx);
    pins->misoPort = AF_USARTRF1_RX_PORT(initData->portLocationRx);
    pins->clkPort  = AF_USARTRF1_CLK_PORT(initData->portLocationClk);
    pins->csPort   = AF_USARTRF1_CS_PORT(initData->portLocationCs);
    pins->mosiPin  = AF_USARTRF1_TX_PIN(initData->portLocationTx);
    pins->misoPin  = AF_USARTRF1_RX_PIN(initData->portLocationRx);
    pins->clkPin   = AF_USARTRF1_CLK_PIN(initData->portLocationClk);
    pins->csPin    = AF_USARTRF1_CS_PIN(initData->portLocationCs);
#endif
  } else {
    return ECODE_EMDRV_SPIDRV_PARAM_ERROR;
  }
  return ECODE_EMDRV_SPIDRV_OK;
}
#endif

